<a href="https://colab.research.google.com/github/sai-teja-ponugoti/Machine-Learning-Concepts/blob/master/Mastering_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

**Reading CSV files using Pandas**

In [0]:
hr = pd.read_csv('HR_comma_sep.csv')

**Finding type of data in columns in a Datafarme**

In [4]:
print(type(hr))
hr.dtypes

<class 'pandas.core.frame.DataFrame'>

satisfaction_level       float64
last_evaluation          float64
number_project             int64
average_montly_hours       int64
time_spend_company         int64
Work_accident              int64
left                       int64
promotion_last_5years      int64
sales                     object
salary                    object
dtype: object

**Printing Dataframes sample data**

In [5]:
print("\nSample data:")
hr.head()

Sample data:

   satisfaction_level  last_evaluation  ...  sales  salary
0                0.38             0.53  ...  sales     low
1                0.80             0.86  ...  sales  medium
2                0.11             0.88  ...  sales  medium
3                0.72             0.87  ...  sales     low
4                0.37             0.52  ...  sales     low

[5 rows x 10 columns]

**Extracting column names from pandas Dataframe to a list**

In [6]:
col_names = hr.columns.tolist()
print("Column names:")
print(col_names)

Column names:
['satisfaction_level', 'last_evaluation', 'number_project', 'average_montly_hours', 'time_spend_company', 'Work_accident', 'left', 'promotion_last_5years', 'sales', 'salary']

**Changing column names in pandas**

In [7]:
hr=hr.rename(columns = {'sales':'department'})
col_names = hr.columns.tolist()
print("Column names:")
print(col_names)

Column names:
['satisfaction_level', 'last_evaluation', 'number_project', 'average_montly_hours', 'time_spend_company', 'Work_accident', 'left', 'promotion_last_5years', 'department', 'salary']

**Checking Nulls in Datframe**

In [8]:
hr.isnull().any()

satisfaction_level       False
last_evaluation          False
number_project           False
average_montly_hours     False
time_spend_company       False
Work_accident            False
left                     False
promotion_last_5years    False
department               False
salary                   False
dtype: bool

**Finshinf Shape of the Dataframe**

In [9]:
hr.shape

(14999, 10)

**Finsing unique values in a column**

In [10]:
hr['department'].unique()

array(['sales', 'accounting', 'hr', 'technical', 'support', 'management',
       'IT', 'product_mng', 'marketing', 'RandD'], dtype=object)

**Cobining different values in a column to single value**

Let us combine “technical”, “support” and “IT” together and call them “technical”.

In [0]:
import numpy as np
# changing support to techincal
hr['department']=np.where(hr['department'] =='support', 'technical', hr['department'])
# changing IT to techincal
hr['department']=np.where(hr['department'] =='IT', 'technical', hr['department'])

In [12]:
hr['department'].unique()

array(['sales', 'accounting', 'hr', 'technical', 'management',
       'product_mng', 'marketing', 'RandD'], dtype=object)

**Counting the number of values of each type in a column**

In [15]:
hr['left'].value_counts()
# hr['department'].value_counts()

0    11428
1     3571
Name: left, dtype: int64

**grouping by a signle column values and using some functions along with it**

In [16]:
hr.groupby('left').mean()

      satisfaction_level  last_evaluation  ...  Work_accident  promotion_last_5years
left                                       ...
0               0.666810         0.715473  ...       0.175009               0.026251
1               0.440098         0.718113  ...       0.047326               0.005321

[2 rows x 7 columns]